HarshAnne/HarshBoot/libs/ch32v003/ch32v003minimal.c
}

void handle_reset( void )
{
	asm volatile( "\n\
.option push\n\
.option norelax\n\
	la gp, __global_pointer$\n\
.option pop\n\
	la sp, _eusrstack\n"
#if __GNUC__ > 10
  ".option arch, +zicsr\n"
#endif
			);

	// Careful: Use registers to prevent overwriting of self-data.
	// This clears out BSS.
	asm volatile(
"	la a0, _sbss\n\
	la a1, _ebss\n\
	bgeu a0, a1, 2f\n\
1:	sw zero, 0(a0)\n\
	addi a0, a0, 4\n\
	bltu a0, a1, 1b\n\
2:"
	// This loads DATA from FLASH to RAM.
"	la a0, _data_lma\n\
	la a1, _data_vma\n\
	la a2, _edata\n\
	beq a1, a2, 2f\n\
1:	lw t0, 0(a0)\n\
	sw t0, 0(a1)\n\
	addi a0, a0, 4\n\
	addi a1, a1, 4\n\
	bltu a1, a2, 1b\n\
2:\n"
#ifdef CPLUSPLUS
	// Call __libc_init_array function
"	call %0 \n\t"
: : "i" (__libc_init_array)
#else
: :
#endif
: "a0", "a1", "a2", "a3", "memory"
);

	// Setup the interrupt vector, processor status and INTSYSCR.
	asm volatile(
"	li t0, 0x1f\n\
	csrw 0xbc0, t0\n"

#if defined(CH32V30x) && !defined( DISABLED_FLOAT )
"	li t0, 0x6088\n\
	csrs mstatus, t0\n"
#else
"	li t0, 0x88\n\
	csrs mstatus, t0\n"
#endif

#if FUNCONF_ENABLE_HPE	// Enabled nested and hardware (HPE) stack, since it's really good on the x035.
"	li t0, 0x0b\n\
	csrw 0x804, t0\n"
#endif
"	la t0, InterruptVector\n\
	ori t0, t0, 3\n\
	csrw mtvec, t0\n"
	: : "InterruptVector" (InterruptVector) : "t0", "memory"
	);

#if defined( FUNCONF_SYSTICK_USE_HCLK ) && FUNCONF_SYSTICK_USE_HCLK && !defined(CH32V10x)
	SysTick->CTLR = 5;
#else
	SysTick->CTLR = 1;
#endif

	// set mepc to be main as the root app.
	asm volatile(
"	csrw mepc, %[main]\n"
"	mret\n" : : [main]"r"(main) );
}

#endif

#if defined( FUNCONF_USE_UARTPRINTF ) && FUNCONF_USE_UARTPRINTF
void SetupUART( int uartBRR )
{
#ifdef CH32V003
	// Enable GPIOD and UART.
	RCC->APB2PCENR |= RCC_APB2Periph_GPIOD | RCC_APB2Periph_USART1;

	// Push-Pull, 10MHz Output, GPIO D5, with AutoFunction
	GPIOD->CFGLR &= ~(0xf<<(4*5));
	GPIOD->CFGLR |= (GPIO_Speed_10MHz | GPIO_CNF_OUT_PP_AF)<<(4*5);
#elif defined(CH32X03x)
	RCC->APB2PCENR |= RCC_APB2Periph_GPIOB | RCC_APB2Periph_USART1;

	// Push-Pull, 10MHz Output, GPIO A9, with AutoFunction
	GPIOB->CFGHR &= ~(0xf<<(4*2));
	GPIOB->CFGHR |= (GPIO_Speed_10MHz | GPIO_CNF_OUT_PP_AF)<<(4*2);
#else
	RCC->APB2PCENR |= RCC_APB2Periph_GPIOA | RCC_APB2Periph_USART1;

	// Push-Pull, 10MHz Output, GPIO A9, with AutoFunction
	GPIOA->CFGHR &= ~(0xf<<(4*1));
	GPIOA->CFGHR |= (GPIO_Speed_10MHz | GPIO_CNF_OUT_PP_AF)<<(4*1);
#endif

	// 115200, 8n1.  Note if you don't specify a mode, UART remains off even when UE_Set.
	USART1->CTLR1 = USART_WordLength_8b | USART_Parity_No | USART_Mode_Tx;
	USART1->CTLR2 = USART_StopBits_1;
	USART1->CTLR3 = USART_HardwareFlowControl_None;

	USART1->BRR = uartBRR;
	USART1->CTLR1 |= CTLR1_UE_Set;
}

// For debug writing to the UART.
WEAK int _write(int fd, const char *buf, int size)
{
	for(int i = 0; i < size; i++){
	    while( !(USART1->STATR & USART_FLAG_TC));
	    USART1->DATAR = *buf++;
	}
	return size;
}

// single char to UART
WEAK int putchar(int c)
{
	while( !(USART1->STATR & USART_FLAG_TC));
	USART1->DATAR = (const char)c;
	return 1;
}
#endif

// #if defined( FUNCONF_USE_DEBUGPRINTF ) && FUNCONF_USE_DEBUGPRINTF


// void handle_debug_input( int numbytes, uint8_t * data ) __attribute__((weak));
// void handle_debug_input( int numbytes, uint8_t * data ) { (void)numbytes; (void)data; }

// static void internal_handle_input( volatile uint32_t * dmdata0 )
// {
// 	uint32_t dmd0 = *dmdata0;
// 	int bytes = (dmd0 & 0x3f) - 4;
// 	if( bytes > 0 )
// 	{
// 		handle_debug_input( bytes, ((uint8_t*)dmdata0) + 1 );
// 	}
// }


// void poll_input()
// {
// 	volatile uint32_t * dmdata0 = (volatile uint32_t *)DMDATA0;
//  	if( ((*dmdata0) & 0x80) == 0 )
// 	{
// 		internal_handle_input( dmdata0 );
// 		// Should be 0x80 or so, but for some reason there's a bug that retriggers.
// 		*dmdata0 = 0x00;
// 	}
// }


// //           MSB .... LSB
// // DMDATA0: char3 char2 char1 [status word]
// // where [status word] is:
// //   b7 = is a "printf" waiting?
// //   b0..b3 = # of bytes in printf (+4).  (5 or higher indicates a print of some kind)
// //     note: if b7 is 0 in reply, but b0..b3 have >=4 then we received data from host.
// // declare as weak to allow overriding.
// WEAK int _write(int fd, const char *buf, int size)
// {
// 	(void)fd;

// 	char buffer[4] = { 0 };
// 	int place = 0;
// 	uint32_t lastdmd;
// 	uint32_t timeout = FUNCONF_DEBUGPRINTF_TIMEOUT; // Give up after ~40ms

// 	if( size == 0 )
// 	{
// 		lastdmd = (*DMDATA0);
// 		if( lastdmd && !(lastdmd&0x80) ) internal_handle_input( (uint32_t*)DMDATA0 );
// 	}
// 	while( place < size )
// 	{
// 		int tosend = size - place;
// 		if( tosend > 7 ) tosend = 7;

// 		while( ( lastdmd = (*DMDATA0) ) & 0x80 )
// 			if( timeout-- == 0 ) return place;

// 		if( lastdmd ) internal_handle_input( (uint32_t*)DMDATA0 );

// 		timeout = FUNCONF_DEBUGPRINTF_TIMEOUT;

// 		int t = 3;
// 		while( t < tosend )
// 		{
// 			buffer[t-3] = buf[t+place];
// 			t++;
// 		}
// 		*DMDATA1 = *(uint32_t*)&(buffer[0]);
// 		t = 0;
// 		while( t < tosend && t < 3 )
// 		{
// 			buffer[t+1] = buf[t+place];
// 			t++;
// 		}
// 		buffer[0] = 0x80 | (tosend + 4);
// 		*DMDATA0 = *(uint32_t*)&(buffer[0]);

// 		//buf += tosend;
// 		place += tosend;
// 	}
// 	return size;
// }

// // single to debug intf
// WEAK int putchar(int c)
// {
// 	int timeout = FUNCONF_DEBUGPRINTF_TIMEOUT;
// 	uint32_t lastdmd = 0;

// 	while( ( lastdmd = (*DMDATA0) ) & 0x80 )
// 		if( timeout-- == 0 ) return 0;

// 	// Simply seeking input.
// 	if( lastdmd ) internal_handle_input( (uint32_t*)DMDATA0 );
// 	*DMDATA0 = 0x85 | ((const char)c<<8);
// 	return 1;
// }

// void SetupDebugPrintf()
// {
// 	// Clear out the sending flag.
// 	*DMDATA1 = 0x0;
// 	*DMDATA0 = 0x80;
// }

// void WaitForDebuggerToAttach()
// {
// 	while( ((*DMDATA0) & 0x80) );
// }

// #endif

// #if (defined( FUNCONF_USE_DEBUGPRINTF ) && !FUNCONF_USE_DEBUGPRINTF) && \
//     (defined( FUNCONF_USE_UARTPRINTF ) && !FUNCONF_USE_UARTPRINTF) && \
//     (defined( FUNCONF_NULL_PRINTF ) && FUNCONF_NULL_PRINTF)

// WEAK int _write(int fd, const char *buf, int size)
// {
// 	return size;
// }

// // single to debug intf
// WEAK int putchar(int c)
// {
// 	return 1;
// }
// #endif

void DelaySysTick( uint32_t n )
{
#ifdef CH32V003
	uint32_t targend = SysTick->CNT + n;
	while( ((int32_t)( SysTick->CNT - targend )) < 0 );
#elif defined(CH32V20x) || defined(CH32V30x)
	uint64_t targend = SysTick->CNT + n;
	while( ((int64_t)( SysTick->CNT - targend )) < 0 );
#elif defined(CH32V10x) || defined(CH32X03x)
	uint32_t targend = SysTick->CNTL + n;
	while( ((int32_t)( SysTick->CNTL - targend )) < 0 );
#else
	#error DelaySysTick not defined.
#endif
}

void SystemInit()
{
#if defined(CH32V30x) && defined(TARGET_MCU_MEMORY_SPLIT)
	FLASH->OBR = TARGET_MCU_MEMORY_SPLIT<<8;
#endif

